# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [5]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
print(PD.head())

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401       1.0
4    2.020000e+11  7/15/15 12:16     G816     7090363        70401       1.0

   price
0    2.0
1    2.0
2    2.0
3    6.0
4    6.0

Use the dtypes attribute to view how each column is stored

In [9]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
print(df_data.dtypes)

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [17]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
result_1 = df_data.loc[:, ['invoice_number', 'invoice_time']]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [19]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
result_2=df_data.loc[0:1]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [53]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
result_3=df_data.loc[0:3, ['invoice_number', 'invoice_time','store_id','product_id','category_id']]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [47]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
result_4=df_data.loc[[0,4,6],['invoice_time','price','store_id']]
result_4

    invoice_time  price store_id
0  7/15/15 10:45    2.0     G816
4  7/15/15 12:16    6.0     G816
6  7/15/15 15:28    2.0     G816

Store the number rows in a variable called num_rows.

In [55]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
num_rows=len(df_data)
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [57]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
print(df_data.tail(1))

      invoice_number  invoice_time store_id  product_id  category_id  \
5381    2.020000e+11  9/5/15 23:38     G619    23030206       210101

      num_item  price
5381       1.0    2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [69]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
avg_price=df_data['price'].mean()
max_price=df_data['price'].max()
print(f"The average is: {avg_price}")
print(f"The max price is: {max_price}")

The average is: 3.1920522110741363
The max price is: 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [75]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
avg_price=df_data['price'].mean()
avg_num_items=df_data['num_item'].mean()
print(f"The average is: {avg_price}")
print(f"The average number of items purchased is: {avg_num_items}")

The average is: 3.1920522110741363
The average number of items purchased is: 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [81]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
df_data['total']=df_data['price'] * df_data['num_item']
print(df_data.head())

   invoice_number   invoice_time store_id  product_id  category_id  num_item  \
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101       1.0
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203       1.0
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401       1.0
4    2.020000e+11  7/15/15 12:16     G816     7090363        70401       1.0

   price  total
0    2.0    2.0
1    2.0    2.0
2    2.0    2.0
3    6.0    6.0
4    6.0    6.0

What is the avgerage price of the three most expensive purchases?

In [87]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
most_expensive=df_data.sort_values(by='price', ascending=False).head(3)
avg_top3=df_data['price'].mean()
avg_top3

3.1920522110741363

How many different products are there?

In [89]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
unique_nums=df_data['product_id'].unique()
unique_nums

array([ 7000300,  7070884,  7070891,  7090363,  7000126,  7308017,
       15000231,  7071096,  7000133,  7071133,  7314599,  7000294,
        7313684,  7071218,  7314612,  7090370, 21000782, 30000742,
        7308765,  7000140,  7070969, 21000430,  7000034,  7000423,
       21050107, 20098391, 30000759, 30000766,  7000409,  7090097,
        7071102,  7071140,  7071164,  7000416, 21000447, 21000379,
       21000362, 30000711,  7090462,  7090509,  7071331, 21050060,
       21050022,  7090455,  7090592, 23030206,  7090493,  7071256,
        7071249,  7090486,  7090479,  7071232,  7090615], dtype=int64)

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [101]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
summary=df_data['price'].describe()
mean=summary['mean']
median=summary['50%']
diff=mean-median
print(diff)

0.6920522110741363

Use the drop() method to delete the column total from the dataframe df_data.

In [113]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
df_data['total']=df_data['price'] * df_data['num_item']
df_data=df_data.drop(columns=['total'])
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [137]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
print(df_data.dtypes)

C:\Users\Jana\AppData\Local\Temp\ipykernel_15300\1038778431.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [143]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
df_data['DOW'] = df_data['invoice_time'].dt.day_name()
df_data['Month'] = df_data['invoice_time'].dt.month_name()
df_data.head()

C:\Users\Jana\AppData\Local\Temp\ipykernel_15300\1343167612.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [149]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Purchase_Data.csv")
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
df_data['DOW'] = df_data['invoice_time'].dt.day_name()
day_counts = df_data['DOW'].value_counts()
num_purchases_wed = day_counts['Wednesday'] if 'Wednesday' in day_counts else 0
num_purchases_wed

C:\Users\Jana\AppData\Local\Temp\ipykernel_15300\4197038661.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [151]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
df_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [161]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
titanic=df_data.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'})
print(titanic.head())

   PassengerId  Pclass                                Passenger_Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch Ticket_Num     Fare Cabin Embarked
0  34.5      0      0     330911   7.8292   NaN        Q
1  47.0      1      0     363272   7.0000   NaN        S
2  62.0      0      0     240276   9.6875   NaN        Q
3  27.0      0      0     315154   8.6625   NaN        S
4  22.0      1      1    3101298  12.2875   NaN        S

Change the index of the df_titanic to the column PasengerID.

In [163]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
df_data=df_data.set_index('PassengerId')
df_data.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [165]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
name_of_passenger=df_data.loc[4,['Name']]
print(name_of_passenger)

Name    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: 4, dtype: object

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [167]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
df_data=df_data.set_index('PassengerId')
df_data=df_data.reset_index()
df_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [171]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
missing_entries=df_data['Age'].isnull().sum()
print(missing_entries)

86

Compute the avg age of passengers ignoring the missing data.

In [173]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
avg_age=df_data['Age'].mean()
print(avg_age)

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [181]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
avg_age=df_data['Age'].mean()
df_data['Age']=df_data['Age'].fillna(avg_age)
df_data.head(15)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.00000,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.00000,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.00000,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.00000,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.00000,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.00000,2,0,A/4 48871,24.1500,NaN,S
10,902,3,"Ilieff, Mr. Ylio",male,30.27259,0,0,349220,7.8958,NaN,S
11,903,1,"Jones, Mr. Charles Cresson",male,46.00000,0,0,694,26.0000,NaN,S
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.00000,1,0,21228,82.2667,B45,S
13,905,2,"Howard, Mr. Benjamin",male,63.00000,1,0,24065,26.0000,NaN,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.00000,1,0,W.E.P. 5734,61.1750,E31,S

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [201]:
import pandas as pd
df_data=pd.read_csv(r"D:\Mobadra\Pandas Practice assignment\Data\Titanic.csv")
df_data=df_data.sort_values(by='Age', ascending=False).head(5)
avg_of_oldest=df_data['Age'].mean()
print(avg_of_oldest)

67.0